/*__________________________________________________________________________________________________________
1. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
Значення площі зберігати в змінній s.
____________________________________________________________________________________________________________*/

/*                   ______AnswerTask1______            */

/*
let height = 23;
let width = 10;
s = height * width;
console.log(s)
*/

/*_________________________________________________________________________________________________________
2. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
результат помістіть у змінну v.
___________________________________________________________________________________________________________*/

/*                 ______AnswerTask2______                    */

/*
let pi=3.14;
let heightС = 10;
let dC = 4;
let r = 2;
let v = pi * dC * heightС;
console.log(v)
*/

/*_________________________________________________________________________________________________________________________________________
3. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
____________________________________________________________________________________________________________________________________________

/*                 ______AnswerTask3______                    */

/*
let n = prompt ('enter n:');
let m = prompt ('enter m:');
let g = Math.sqrt (Math.pow(n, 2) + Math.pow(m, 2));
let k = g.toFixed(2);
alert (k);
*/

/*_________________________________________________________________________________________________________________________________________
4. Визначити відповідний оператор в виразах що б вийшов відповідний результат. В однакових виразах не використовувати однакові оператори!!!
5 ? 6 -> true
5 ? 6 -> false
5 ? 6 -> false
5 ? 6 -> false
10 ? 10 -> true
10 ? 10 -> true
10 ? 10 -> false
10 ? 10 -> false
10 ? 10 -> false
123 ? '123' -> false
123 ? '123' -> true
__________________________________________________________________________________________________________________________________________*/

/*                 ______AnswerTask4______                    */

/*
5 < 6
5 > 6
5 == 6
5 === 6
10 == 10
10 === 10
10 < 10
10 > 10
10 != 10
123 > 123
123 == 123
*/

/*______________________________________________________________________
5. Створити змінні. Присвоїти кожному з них значення:
'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
Вивести кожну змінну за допомогою: console.log , alert, document.write
______________________________________________________________________*/

/*                   ______AnswerTask5______                          */

/*
let z1 = 'hello';
let z2 = 'owu';
let z3 = 'com';
let z4 = 'ua';
let z5 = 1;
let z6 = 10;
let z7 = -999;
let z8 = 123;
let z9 = 3.14;
let z10 = 2.7;
let z11 = 16;
let z12 = true;
let z13 = false;
console.log(z1);
...
console.log (z13);
alert (z1);
...
alert (z13);
document.write(z1);
...
document.write(z13);
 */


/* __________________________________________________________
6. Створити об'єкт book з наступними полями :
назва, (тип string)
кількість сторінок (числовий тип),
жанр (string)
______________________________________________________________*/

/*                       _____AnswerTask6_____                 */

/*
let book = {
title: 'C++',
pages: 327,
genre: 'Programing'
};
console.log(book);
*/

/* ____________________________________________________________________________________________________
7. Створити об'єкт book з наступними полями : назва, (тип string)
кількість сторінок (числовий тип), жанр (string) автори (тип - масив, кожен елемент масиву - це стрінга)
________________________________________________________________________________________________________*/

/*                      _____AnswerTask7_____

let book1 = {
   name: 'C++',
   pages: 324,
   genre: 'Programing',
   authors: [ 'Stroustrup', 'Prata', 'Gritsiuk' ]
}
 console.log(book1);
 */

/*__________________________________________________________________________
8. Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ.
З'єднати їх в одну змінну person
(Не об'єкт, просто за допомоги конкатенації)
____________________________________________________________________________*/

/*
                        _____AnswerTask8_____

let firstName = 'Oksna';
let middleName = 'Volodymyrivna';
let lastName = 'Oborska';
let person = firstName + ' ' + middleName + ' ' + lastName;
console.log(person);
*/

/*_________________________________________________________________________
9. За допомогою 3х різних prompt() отримати 3 слова які являються вашими
Ім`ям, По-Батькові та роками. та вивести в консоль
___________________________________________________________________________*/

/*                        _____AnswerTask9_____                 */

/*
let firstName = prompt('enter you first name');
let middleName = prompt('enter you middle name');
let lastName = prompt('enter you last name');
console.log(person);
 */


/*___________________________________________________________________________________
10. За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
let a = 100; let b = '100'; let c = true;
_____________________________________________________________________________________*/

/*                          _____AnswerTask10_____                     */

/*
let a = 100;
let b = '100';
let c = true;
console.log(typeof a);
console.log(typeof b);
console.log(typeof c);
*/

/*_____________________________________________________________________________________
11. Створити масив об'єктів з назвою books з наступними полями
 назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
 ______________________________________________________________________________________*/

/*                           _____AnswerTask11_____                   */

/*
let books = [
    {title: 'book1', pages: 100, genre: 'programing', authors: ['abc', 'abc', 'abc']},
    {title: 'book2', pages: 101, genre: 'fantasy', authors: ['abc', 'abc', 'abc']},
    {title: 'book3', pages: 102, genre: 'history', authors: ['abc', 'abc', 'abc']},
    {title: 'book4', pages: 104, genre: 'drama', authors: ['abc', 'abc', 'abc']}
];

console.log(books[0]);
console.log(books[1]);
console.log(books[2]);
console.log(books[3]);
*/
